package com.example.ayaziy

import android.os.Bundle
import android.view.View
import androidx.fragment.app.Fragment
import kotlinx.android.synthetic.main.omirlik_joli.*

class OmirlikJoliFragment:Fragment(R.layout.omirlik_joli) {
    override fun onViewCreated(view: View, savedInstanceState: Bundle?) {
        super.onViewCreated(view, savedInstanceState)
        omirlik_joli_text.text="Ибрайим Юсупович Юсупов, (5 май 1929 — 24 июл 2008) - қарақалпақ шайыры, аўдармашы ҳәм драматург, педагог. Өзбекстан ҳәм Қарақалпақстан халық шайыры. Өзбекстан Қаҳарманы.1929 жыл 5 майда Азат аўылында ( Қарақалпақстан) туўылг'ан. Келешектеги шайыр Юсуп Аҳун Сайекейев (1875-1931) әкеси сол дәўир нормалары бойынша диний ғайраткер ҳәм ири жер ийеси болып, ол ушын Совет ҳүкимети тәрепинен тәқип етилип, Туркменистанға репрессия етилген, сүргиннен қайтмаган, Хонбиби анасы еки ул ҳәм төрт қызды тәрбиялаған. Шаңарақты бағыўда анасина жәрдем бериў ушын Ибрайим 13 жыл ишинде пул ислеўди баслады. Қарақалпақ педагогика институтында оқыған. Институтты тамамлаганнан сон', 1949 жылда ол әдебият па'нинен сабақ бере баслады. 1952 жилда ол буржуа-мыллетшил группалар менен шериклик қылыўда айбланг'ан ҳәм жынаят иси қозғатылған. Бирақ дәлиллердиң жетиспеўшилиги себеп ақланди. 1961-1962 жылларда \" Амударя\" журналы редакторы, кейининен СССР ФА қарақалпақ филиалы тил, әдебият ҳәм тарийх институтына илимий жумыс алып барды. 1965-1980 жылларда Қарақалпақ АССР жазыўшылар аўқамына басшылық еткен. Кейинирек 1980-1985 жылларда Қарақалпақстан тынышлық ҳәм арқайи’нликти қорғаў комитети баслығы, руўхыйлық ҳәм билим орайы басшысы лаўазымында ислеген. Ол бир неше рет касср Жоқарғы Кеңеси депутаты етип сайланды. 1990 -1994 жылларда О'зССР ҳәм Өзбекстан Жоқарғы Кеңеси депутатлығына сайланды. И. А. Каримов Өзбекстан Республикасы президенти сайлаўында бир неше мәрте исенимли шахс болған және оның кандидатин актив қоллап -қуўатлаған, қызғын тәрепдары болған. Өзбекстан Республикасы президенти И. А. Каримов И. Юсупов қаза болг'ан сон' шайыр шаңарағына муңласлық билдирди:\n" +
                "\n" +
                "Ол қайда ислесе де, шөлкемлестириўшилик қәбилетлери, билим ҳәм тәжирийбеси менен балшық жерде халықтың абырайсы ҳәм ҳүрметине ийе болды. Қайсын Кулийев Елши Гамзатов, Чингиз Айтпатов ҳәм Ибрайим Юсупов қатнасыўында Қримда СССР шайырлары ҳәм жазыўчиларининг ушырасыўларынан бири: \" Ибрайим Юсупов туркий тилли халықлар поезиясының Наўайи ҳәм Мақтумқули менен бирге пайғамбари\". Ибрайим Юсупов ҳәйкели Ташкент деги жазыўшылар қыябанында орнатылған.Юсуповнинг биринши дөретпелери 1949 жылда баспадан шығарылған. Олкәраынан \" ески тутовникда куз\" (\"Г'арри туттаг'и гуз\"), \" бахыт Лйрицс\" (\" бахыт лйрицс\"), \" Шығыстан саяхатчига\" (\" Кнншйгйс көз жас о'шйсина\"), \" Севен пасс\" (\" Жети Асирим\"), \" саҳра әрманлари\" (\" Даламанрманлар\"), \" әсир даўамында\" (\" заман\") сыяқлы қыссалары ҳәм қыссалары комплекси жазылды. \" поезия\", \" Тамырис ҳәм басқа дәстанлар\", \" Ёш\". Қарақалпақ музыкалы драма театри ушын \" қырық қиз\" (\" қырық қиз\"), \" актрисанинг тәғдири\" (\" актрисалар баласы\"), \" Жокер Умирбек\" (\" ммирбек лақа\") песалари жазылған. Юсупов соның менен бирге, орыс ҳәм басқа әдебиятлардың ески дөретпелерин қарақалпақ тилине аўдарма еткен: А. С. Пушкин, М. ю. Лермонтов, Т. Г. Шевченко, Абай, Г. Тукай, Шекспир ҳәм басқалар.\n" +
                "\n" +
                "Иброҳим Юсуповнинг уқыпы Өзбекстан ғәрезсизлиги жылларында үлкен күш менен көринетуғын болды. Рамил Исламов өзиниң 80 жыллығы мунасәбети менен сондай деди: \" қосық ҳәм дәстанларында, публитсистик мақалаларында ол өз халқиниң еркин өмирин, мәмлекетте жүз берип атырған түпкиликли өзгерислерди мақтаныш менен куйлади\".\n" +
                "\n" +
                "И. Юсуповнинг опаты мунасәбети менен мәмлекет Президенти И. Каримов та'зия билдириў етди. Нөкис қаласындағы \" Шорша Баба\" әўлийеине көмиў етилген.Qaraqalpaqsha Transliterator | Қарақалпақша Транслитератор, [28.05.21 23:13]\n" +
                "Өзбекстан Қаҳарманы (2004)\n" +
                "\"Ел-журт ҳүрмети\" ордени (1999) \n" +
                "\"Дослық\" ордени\n" +
                "Мийнет қызыл байрақ ордени (04. 05. 1979)\n" +
                "Өзбекстан халық шайыры.Әке: Юсуп Охун Сайекеев (1875-1932-жыллар өмириниң шамалық жыллары).\n" +
                "\n" +
                "Ана: Хонбиби Ҳожамурат қызы (1898-1974-жыллар өмириниң шамалық жыллары).\n" +
                "\n" +
                "Турмыс Жорасы: Бибизада Жуманазарова (1934-1980).\n" +
                "\n" +
                "Балалар :\n" +
                "\n" +
                "Шаҳзада Юсупова (ақлықлары: Султан, Хансулу, Алия).\n" +
                "Пайдам Юсупов (ақлықлары: Абдунайим.)\n" +
                "Мадияр Юсупов (ақлықлары: Аллаяр ҳәм Данияр).\n" +
                "Арухан Юсупова (ақлықлары: Тимур ҳәм Шолпан ).\n" +
                "Айжамал Юсупова (ақлықлары: Илёс, Баҳоуатдин, Айсулю, Айзада)."


    }
}